# 23-feb_Pandas Assignment

### name:prem shejole

#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [7]:

df=pd.Series([4,8,15,16,23,42])
print(df)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2.Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
lst=[1,2,3,4,5,6,7,8,9,10]
df2=pd.Series(lst)
print(df2)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

#### Q3.Create a Pandas DataFrame that contains the following data:

In [9]:
data={"Name":["Alice","Bob","Claire"],
      "Age":[25,30,27],
      "Gender":["Female","Male","Female"]
     }

In [10]:
df3=pd.DataFrame(data)

In [11]:
df3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [12]:
# dataframe is the collection of series that can be used to anlyse the data
# dataframe is a two dimensional while series is one dimensional
# dataframe is heterogenous because the elements in dataframe can have different datatypes
# series is homogenous because the elements in series have same datatypes

In [13]:
df4=pd.Series([1,2,3,4,5,6])
df4

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [14]:
data1={"name":["prem","dipak"],
       "surname":["shejole","shejole"]
      }

df5=pd.DataFrame(data1)
df5

    name  surname
0   prem  shejole
1  dipak  shejole

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

In [15]:
# pd.read_csv we use this function to read the data from the csv file
df6=pd.read_csv("players.csv")

In [16]:
# pd.head() this function is for listing first rows bydefault it print first five rows
df6.head()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
0,1,Quincy Acy,PF,24,NYK,68,22,1287,152,331,...,.784,79,222,301,68,27,22,60,147,398
1,2,Jordan Adams,SG,20,MEM,30,0,248,35,86,...,.609,9,19,28,16,16,7,14,24,94
2,3,Steven Adams,C,21,OKC,70,67,1771,217,399,...,.502,199,324,523,66,38,86,99,222,537
3,4,Jeff Adrien,PF,28,MIN,17,0,215,19,44,...,.579,23,54,77,15,4,9,9,30,60
4,5,Arron Afflalo,SG,29,TOT,78,72,2502,375,884,...,.843,27,220,247,129,41,7,116,167,1035

In [17]:
# pd.tail() this function is for listing last rows bydefault it print first five rows
df6.tail()

,Rk,Player,Pos,Age,Tm,G,GS,MP,FG,FGA,...,FT%,ORB,DRB,TRB,AST,STL,BLK,TOV,PF,PTS
670,490,Thaddeus Young,PF,26,TOT,76,68,2434,451,968,...,.655,127,284,411,173,124,25,117,171,1071
671,490,Thaddeus Young,PF,26,MIN,48,48,1605,289,641,...,.682,75,170,245,135,86,17,75,115,685
672,490,Thaddeus Young,PF,26,BRK,28,20,829,162,327,...,.606,52,114,166,38,38,8,42,56,386
673,491,Cody Zeller,C,22,CHO,62,45,1487,172,373,...,.774,97,265,362,100,34,49,62,156,472
674,492,Tyler Zeller,C,25,BOS,82,59,1731,340,619,...,.823,146,319,465,113,18,52,76,205,833

In [18]:
#df6.columns it lists the column names
df6.columns

Index(['Rk', 'Player', 'Pos', 'Age', 'Tm', 'G', 'GS', 'MP', 'FG', 'FGA', 'FG%',
       '3P', '3PA', '3P%', '2P', '2PA', '2P%', 'eFG%', 'FT', 'FTA', 'FT%',
       'ORB', 'DRB', 'TRB', 'AST', 'STL', 'BLK', 'TOV', 'PF', 'PTS'],
      dtype='object')

In [19]:
# extracting single column
df6['Player']

0          Quincy Acy
1        Jordan Adams
2        Steven Adams
3         Jeff Adrien
4       Arron Afflalo
            ...
670    Thaddeus Young
671    Thaddeus Young
672    Thaddeus Young
673       Cody Zeller
674      Tyler Zeller
Name: Player, Length: 675, dtype: object

In [20]:
# extracting m ultiple column
df6[['Pos','Age','GS']]

    Pos Age  GS
0    PF  24  22
1    SG  20   0
2     C  21  67
3    PF  28   0
4    SG  29  72
..   ..  ..  ..
670  PF  26  68
671  PF  26  48
672  PF  26  20
673   C  22  45
674   C  25  59

[675 rows x 3 columns]

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [1]:
# series is 1 dimensional homogenous array with immutable size
# dataframe is 2 dimensional heterogenous array with mutable size
# panel is 3D labeled mutable size array

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [14]:
import pandas as pd
s1=pd.Series([1,2,3,4])

In [15]:
s2=pd.Series(['p','r','e','m'])
s3=pd.Series([100,200,300,400])

In [19]:
dataframe1=pd.DataFrame(s3,s1)

In [20]:
dataframe1

       0
1  200.0
2  300.0
3  400.0
4    NaN

In [21]:
# we can add multiple dataframes by usinf concat function
df5=pd.concat([s1,s2,s3],axis=1)

In [22]:
df5

   0  1    2
0  1  p  100
1  2  r  200
2  3  e  300
3  4  m  400